#include <iostream>
#include <pthread.h>
#include <semaphore.h>
#include <stdlib.h>
#include <ctime>

/*
 * Работу выполнил Филатов Юрий Алексеевич
 * Группа: БПИ193
 * Вариант определен: 23 % 22 = 1.
 * Задача о парикмахере.
 *
 * Условие задания:
 * В тихом городке есть парикмахерская.
 * Салон парикмахерской мал, ходить там может только парикмахер и один посетитель.
 * Парикмахер всю жизнь обслуживает посетителей.
 * Когда в салоне никого нет, он спит в кресле.
 * Когда посетитель приходит и видит спящего парикмахера, он будет его,
 * садится в кресло и спит, пока парикмахер занят стрижкой.
 * Если посетитель приходит, а парикмахер занят, то он встает в очередь и засыпает.
 * После стрижки парикмахер сам провожает посетителя.
 * Если есть ожидающие посетители, то парикмахер будит одного из них и ждет
 * пока тот сядет в кресло парикмахера и начинает стрижку.
 * Если никого нет, он снова садится в свое кресло и засыпает до прихода посетителя.
 * Создать многопоточное приложение, моделирующее рабочий день парикмахерской.
 *
 */

using namespace std;

//типа причесок
string hairCuts[12] =
        {"Кроп",
         "Флэт-топ",
         "Фэйд",
         "Помпадур",
         "Ирокез",
         "Квифф",
         "Канадка",
         "Сайд парт",
         "Андеркат",
         "Мэн бан",
         "Маллет",
         "Каре"};

//номер посетителя
int v = 0;

bool armChair = false; //кресло
const int queueSize = 80;
int visitors[queueSize];

sem_t chair; //семафор, отображающий кресло и претендентов на попадание в него

pthread_mutex_t mutexChair; //мутекс для кресла

//генерация очереди
void *hairCutting(void *param) {
    while (true) {
            //критическая секция
            pthread_mutex_lock(&mutexChair); //защита очереди
            sem_wait(&chair);
            visitors[v] = v;
            cout << "Visitor" + to_string(v) + " садится в кресло.\n";
            armChair = true;    //имитируем, что посетитель сел в кресло
            string str = armChair ? " сидит в кресле.\n" : "ЭТА СТРОКА НЕВОЗМОЖНА БЛАГОДАРЯ МУТЕКСАМ";
            cout << "Visitor" + str;
            cout << "Visitor" + to_string(v) + " сделал прическу " + hairCuts[rand() % 12] + ".\n";
            armChair = false;   //имитируем, что посетитель встал с кресла
            v++;
            pthread_mutex_unlock(&mutexChair);
    }
}

int main() {
    srand(time(NULL));

    //инициализация мутекса и семафора
    pthread_mutex_init(&mutexChair, nullptr);
    sem_init(&chair, 0, 1); //количество свободных ячеек равно 1 - всего одно кресло

    //создание очереди
    pthread_t threadQueue[queueSize];
    pthread_t pthread;

    for (int i = 0; i < queueSize; ++i) {
        pthread_create(&threadQueue[i], nullptr, hairCutting, (void *) (i));
    }

    //пока в очереди стоят люди пропускаем их
    while (v < queueSize) {
        sem_post(&chair);
    }

    return 0;
}
